# Created 2022-10-31 mån 00:45
#+title: 7-limit
#+author: Henrik Frisk
*** pitches used (extracted from lilypond)

Simple version
#+begin_src shell
  grep '[0-9]\+\/[0-9]\+' chords.ly | sed 's/1.1//g'
#+end_src

Better, run this to update [[file:ratios_sc.txt]]
#+begin_src shell
  grep '[0-9]\+\/[0-9]\+' chords.ly > ratios.txt
  tr -d " " < ratios.txt > ratios_sc.txt
#+end_src

#+RESULTS:

Then, run this to create the table. Add '#+name: pitches' to the result block in order to have it read by the scripts below.
Then run [[make_pitch_arrays][make_pitch_arrays]] and [[make_spat_arrays][make_spat_arrays]] to generate the data for suppercollider.

The result needs to be named ~pitches~
#+name: create_pitch_list
#+begin_src perl :results value :name "#+name: pitches"
  my $filename = './ratios_sc.txt';
  my $line;

  open(FH, '<', $filename) or die $!;
  while(<FH>) {
#      if (index($_, "1/1") != -1) {
#          last;
#      }
      $line = $line.$_;
  }
  close(FH);
  return $line;
#+end_src

#+RESULTS: create_pitch_list
#+name: pitches
| 15/8  |
| 3/2   |
| 5/4   |
| 8/5   |
| 3/2   |
| 6/5   |
| 16/15 |
| 8/5   |
| 4/3   |
| 5/4   |
| 5/3   |
| 4/3   |
| 7/4   |
| 12/7  |
| 7/6   |
| 7/4   |
| 12/7  |
| 8/7   |
| 15/8  |
| 15/14 |
| 3/2   |
| 40/21 |
| 5/3   |
| 4/3   |
| 32/21 |
| 16/9  |
| 4/3   |
| 64/49 |
| 96/49 |
| 4/3   |
| 32/27 |
| 10/9  |
| 16/9  |
| 10/9  |
| 40/21 |
| 5/3   |
| 15/8  |
| 3/2   |
| 5/4   |
| 5/4   |
| 1/1   |
| 5/3   |
| 10/9  |
| 5/3   |
| 4/3   |
| 64/45 |
| 15/14 |
| 12/7  |
| 5/4   |
| 5/3   |
| 4/3   |
| 5/3   |
| 9/8   |
| 7/4   |
| 9/8   |
| 3/2   |
| 6/5   |
| 64/45 |
| 27/14 |
| 5/3   |


*** table of pitch-space mapping
Following the map in the paper Crystal Growth [cite:@tenney08_growt_harmon_space] by Tenney the following mapping between pitch and space is proposed:
#+name: pitch_space_map
| ndx | ratio   |          az |         el | rad |
|-----+---------+-------------+------------+-----|
|   1 | 1/1     |         0.0 |          0 |   0 |
|   2 | 3/2     |   1.5707963 |          0 |   1 |
|   3 | 8/5     |   3.1415927 |          0 |   1 |
|   4 | 4/3     |  -1.5707963 |          0 |   1 |
|   5 | 5/4     |         0.0 |          0 |   1 |
|   6 | 7/4     |  0.78539816 | 0.47123890 |   1 |
|   7 | 12/7    |   2.3561945 | 0.47123890 |   1 |
|   8 | 8/7     |  -2.3561945 | 0.47123890 |   1 |
|   9 | 7/6     | -0.78539816 | 0.47123890 |   1 |
|  10 | 15/14   |  0.39269908 | 0.62831853 |   1 |
|  11 | 96/49   |   2.7488936 | 0.62831853 |   1 |
|  12 | 64/49   |  -2.7488936 | 0.62831853 |   1 |
|  13 | 10/17   |  0.39269908 | 0.62831853 |   1 |
|  14 | 15/8    |  0.78539816 | 0.62831853 |   2 |
|  15 | 9/8     |   1.5707963 | 0.62831853 |   2 |
|  16 | 6/5     |   2.3561945 | 0.62831853 |   2 |
|  17 | 16/15   |  -2.3561945 | 0.62831853 |   2 |
|  18 | 16/9    |  -1.5707963 | 0.62831853 |   2 |
|  19 | 5/3     | -0.78539816 | 0.78539816 |   2 |
|  20 | 45/28   |  0.78539816 | 0.78539816 |   2 |
|  21 | 64/32   |   1.4137167 | 0.78539816 |   2 |
|  22 | 27/14   |   1.7278760 | 0.78539816 |   2 |
|  23 | 256/114 |  -2.3561945 | 0.78539816 |   2 |
|  24 | 32/21   |  -1.7278760 | 0.78539816 |   2 |
|  25 | 4/21    | -0.78539816 | 0.78539816 |   2 |
|  26 | 45/32   |  0.78539816 | 0.94247780 |   3 |
|  27 | 27/16   |   1.5707963 | 0.94247780 |   3 |
|  28 | 9/5     |   2.3561945 | 0.94247780 |   3 |
|  29 | 36/35   |   2.5132741 | 0.94247780 |   3 |
|  30 | 48/35   |   2.8274334 | 0.94247780 |   3 |
|  31 | 64/35   |  -2.9845130 | 0.94247780 |   3 |
|  32 | 128/105 |  -2.5132741 | 0.94247780 |   3 |
|  33 | 512/315 |  -2.3561945 | 0.94247780 |   3 |
|  34 | 64/45   |  -2.5132741 | 0.94247780 |   3 |
|  35 | 258/189 |  -1.8849556 | 0.94247780 |   3 |
|  36 | 64/63   |  -2.0420352 | 0.94247780 |   3 |
|  37 | 32/27   |  -1.5707963 | 0.94247780 |   3 |
|  38 | 80/63   |  -1.2566371 | 0.94247780 |   3 |
|  39 | 10/9    | -0.78539816 | 0.94247780 |   3 |
|  40 | 16/5    |  -2.5132741 | 0.62831853 |   2 |
|  41 | 40/21   | -0.52359878 | 0.94247780 |   2 |
#+TBLFM: @3$3=$pi*0.5::@3$4=0::@4$3=$pi::@5$3=-0.5*$pi::@7$3=$pi*0.25::@7$4=$pi*0.5*0.3::@8$3=0.75*$pi::@8$4=$pi*0.5*0.3::@9$3=-0.75*$pi::@9$4=$pi*0.5*0.3::@10$3=-0.25*$pi::@10$4=$pi*0.5*0.3::@11$3=0.125*$pi::@11$4=0.4*0.5*$pi::@12$3=0.875*$pi::@12$4=0.4*0.5*$pi::@13$3=-0.875*$pi::@13$4=0.4*0.5*$pi::@14$3=0.125*$pi::@14$4=0.4*0.5*$pi::@15$3=0.25*$pi::@15$4=0.4*0.5*$pi::@16$3=0.5*$pi::@16$4=0.4*0.5*$pi::@17$3=0.75*$pi::@17$4=0.4*0.5*$pi::@18$3=-0.75*$pi::@18$4=0.4*0.5*$pi::@19$3=-0.5*$pi::@19$4=0.4*0.5*$pi::@20$3=-0.25*$pi::@21$3=0.25*$pi::@21$4=0.5*0.5*$pi::@22$3=0.45*$pi::@22$4=0.5*0.5*$pi::@23$3=0.55*$pi::@23$4=0.5*0.5*$pi::@24$3=-0.75*$pi::@24$4=0.5*0.5*$pi::@25$3=-0.55*$pi::@25$4=0.5*0.5*$pi::@26$3=-0.25*$pi::@26$4=0.5*0.5*$pi::@27$3=0.25*$pi::@27$4=0.6*0.5*$pi::@28$3=0.5*$pi::@28$4=0.6*0.5*$pi::@29$3=0.75*$pi::@29$4=0.6*0.5*$pi::@30$3=0.8*$pi::@30$4=0.6*0.5*$pi::@31$3=0.9*$pi::@31$4=0.6*0.5*$pi::@32$3=-0.95*$pi::@32$4=0.6*0.5*$pi::@33$3=-0.8*$pi::@33$4=0.6*0.5*$pi::@34$3=-0.75*$pi::@34$4=0.6*0.5*$pi::@35$3=-0.8*$pi::@35$4=0.6*0.5*$pi::@36$3=-0.6*$pi::@36$4=0.6*0.5*$pi::@37$3=-0.65*$pi::@37$4=0.6*0.5*$pi::@38$3=-0.5*$pi::@38$4=0.6*0.5*$pi::@39$3=-0.4*$pi::@39$4=0.6*0.5*$pi::@40$3=-0.25*$pi::@40$4=0.6*0.5*$pi::@41$3=-0.8*$pi::@41$4=0.4*0.5*$pi::@42$3=$pi/3*-2
*** code to manipulate data
Output one ratio from the table
#+begin_src shell :var data=pitches[3:4,0]
  echo $data
#+end_src

#+RESULTS:
: 8/5

List all ratios from the pitches table in lisp
#+begin_src emacs-lisp :var alst=pitch_space_map[2:3,1] pit=pitches[,0]
  (cons (car pit) (nthcdr 2 pit))
#+end_src

Browse through the pitch_space_map table in scheme (example)
#+begin_src scheme :results value :exports none :var aval=pitch_space_map[1:2,1] eval=pitch_space_map[1:2,2] dval=pitch_space_map[1:2,3]
  (define (spat_aed x y z result)
    (cond ((null? x) result)
          ((spat_aed (cdr x) (cdr y) (cdr z) (append result (list (car x) (car y) (car z)))))))
  (spat_aed aval eval dval '())
#+end_src

Script to create the MatrixArray for supercollider from the [[pitches][pitch list]]. The result needs to be named ~pitch_arrays~
#+name: make_pitch_arrays
#+begin_src perl :results output raw :var data=pitches space=pitch_space_map :exports code :noweb yes :wrap "SRC sclang :tangle sclang_output.sc" 
  sub org_table_size  
  {
      # return the number of columns and rows in a table
      my ($table) = @_;
      my $y = $$table[0];
      return(scalar(@$y), scalar (@$table));
  }
  my @result;

  my ($cols, $rows) = org_table_size($space);
  my ($pcol, $prow) = org_table_size($data);
  my $crntp = 0;
  my @az = 0;
  my @el = 0;
  my @rad = 0;
  my $res_string = "";
  my $sc_array = "~notesArrays = MatrixArray.with([[";
  my $sc_array_end = "]);";
  my $counter = 0;
  my $test = "";
  my $index = 0;

  $res_string = $sc_array;
  for my $i ($0..$prow-1) {
      $index++;
      $crntp = $$data[$i][0];
      if($counter < 2) {
          $res_string = $res_string.$crntp.", ";
          $counter++;
      } else {
          $res_string = $res_string.$crntp;
          $counter = 0;
          if($index < $prow) {
              $res_string = $res_string."], ["
          } else {
              $res_string = $res_string."]]);\n"
          }
      }
  }
  print $res_string;
#+end_src

#+RESULTS: make_pitch_arrays
#+name: pitch_arrays
#+begin_SRC sclang :tangle sclang_output.sc
~notesArrays = MatrixArray.with([[15/8, 3/2, 5/4], [8/5, 3/2, 6/5], [16/15, 8/5, 4/3], [5/4, 5/3, 4/3], [7/4, 12/7, 7/6], [7/4, 12/7, 8/7], [15/8, 15/14, 3/2], [40/21, 5/3, 4/3], [32/21, 16/9, 4/3], [64/49, 96/49, 4/3], [32/27, 10/9, 16/9], [10/9, 40/21, 5/3], [15/8, 3/2, 5/4], [5/4, 1/1, 5/3], [10/9, 5/3, 4/3], [64/45, 15/14, 12/7], [5/4, 5/3, 4/3], [5/3, 9/8, 7/4], [9/8, 3/2, 6/5], [64/45, 27/14, 5/3]]);
#+end_SRC

Script to create the MatrixArray for supercollider from the [[pitches][pitch list]] and the mapped spatialisations in the [[*table of pitch-space mapping][pitch_space table]]. The result needs to be named ~spat_arrays~
#+name: make_spat_arrays
#+begin_src perl :results output raw :var data=pitches space=pitch_space_map :exports code :noweb yes :wrap "SRC sclang :tangle sclang_output.sc" 
  sub org_table_size  
  {
      # return the number of columns and rows in a table
      my ($table) = @_;
      my $y = $$table[0];
      return(scalar(@$y), scalar (@$table));
  }
  my @result;

  my ($cols, $rows) = org_table_size($space);
  my ($pcol, $prow) = org_table_size($data);
  my $crntp = 0;
  my @az = 0;
  my @el = 0;
  my @rad = 0;
  my $res_string = "";
  my $sc_array = "MatrixArray.with([[";
  my $sc_array_end = "]);";
  my $counter = 0;
  my $test = "";
  my $index = 0;

  for my $i ($0..$prow-1) {
      $crntp = $$data[$i][0];
      for my $j ($0..$rows-1) {
          if($$space[$j][1] eq $crntp) {
              $az[$i] = $$space[$j][2];
              $el[$i] = $$space[$j][3];
              $rad[$i] = $$space[$j][4];
          }
      }
  }

  ## aximuth
  $res_string = $res_string."~spatArrays = ".$sc_array;
  foreach(@az) {
      $index++;
      if($counter < 2) {
          $res_string = $res_string.$_;
          $res_string = $res_string.", ";
          $counter++;
      } else {
          $res_string = $res_string.$_;
          $counter = 0;
          if($index < $#az) {
              $res_string = $res_string."], ["
          } else {
              $res_string = $res_string."]]);\n"
          }
      }
  }
  $index = 0;

  ## elevation
  $res_string = $res_string."~elArrays = ".$sc_array;
  foreach(@el) {
      $index++;
      if($counter < 2) {
          $res_string = $res_string.$_;
          $res_string = $res_string.", ";
          $counter++;
      } else {
          $res_string = $res_string.$_;
          $counter = 0;
          if($index < $#az) {
              $res_string = $res_string."], ["
          } else {
              $res_string = $res_string."]]);\n"
          }
      }
  }
  $index = 0;

  ## radius
  $res_string = $res_string."~radArrays = ".$sc_array;
  my $multi = 3;
  foreach(@rad) {
      $index++;
      if($counter < 2) {
          $res_string = $res_string.$_*$multi;
          $res_string = $res_string.", ";
          $counter++;
      } else {
          $res_string = $res_string.$_*$multi;
          $counter = 0;
          if($index < $#az) {
              $res_string = $res_string."], ["
          } else {
              $res_string = $res_string."]]);\n"
          }
      }
  }
  $index = 0;
  print $res_string;
#+end_src

#+RESULTS: make_spat_arrays
#+name: spat_arrays
#+begin_SRC sclang :tangle sclang_output.sc
~spatArrays = MatrixArray.with([[0.78539816, 1.5707963, 0.0], [3.1415927, 1.5707963, 2.3561945], [-2.3561945, 3.1415927, -1.5707963], [0.0, -0.78539816, -1.5707963], [0.78539816, 2.3561945, -0.78539816], [0.78539816, 2.3561945, -2.3561945], [0.78539816, 0.39269908, 1.5707963], [-0.52359878, -0.78539816, -1.5707963], [-1.727876, -1.5707963, -1.5707963], [-2.7488936, 2.7488936, -1.5707963], [-1.5707963, -0.78539816, -1.5707963], [-0.78539816, -0.52359878, -0.78539816], [0.78539816, 1.5707963, 0.0], [0.0, 0.0, -0.78539816], [-0.78539816, -0.78539816, -1.5707963], [-2.5132741, 0.39269908, 2.3561945], [0.0, -0.78539816, -1.5707963], [-0.78539816, 1.5707963, 0.78539816], [1.5707963, 1.5707963, 2.3561945], [-2.5132741, 1.727876, -0.78539816]]);
~elArrays = MatrixArray.with([[0.62831853, 0, 0], [0, 0, 0.62831853], [0.62831853, 0, 0], [0, 0.78539816, 0], [0.4712389, 0.4712389, 0.4712389], [0.4712389, 0.4712389, 0.4712389], [0.62831853, 0.62831853, 0], [0.9424778, 0.78539816, 0], [0.78539816, 0.62831853, 0], [0.62831853, 0.62831853, 0], [0.9424778, 0.9424778, 0.62831853], [0.9424778, 0.9424778, 0.78539816], [0.62831853, 0, 0], [0, 0, 0.78539816], [0.9424778, 0.78539816, 0], [0.9424778, 0.62831853, 0.4712389], [0, 0.78539816, 0], [0.78539816, 0.62831853, 0.4712389], [0.62831853, 0, 0.62831853], [0.9424778, 0.78539816, 0.78539816]]);
~radArrays = MatrixArray.with([[6, 3, 3], [3, 3, 6], [6, 3, 3], [3, 6, 3], [3, 3, 3], [3, 3, 3], [6, 3, 3], [6, 6, 3], [6, 6, 3], [3, 3, 3], [9, 9, 6], [9, 6, 6], [6, 3, 3], [3, 3, 6], [9, 6, 3], [9, 3, 3], [3, 6, 3], [6, 6, 3], [6, 3, 6], [9, 6, 6]]);
#+end_SRC

